Revit 2026 API

# ExecutedEventArgsSetJournalData Method

---
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetJournalData(
	IDictionary<string, string> data
)
```
```vb
Public Sub SetJournalData (
	data As IDictionary(Of String, String)
)
```
```cpp
public:
void SetJournalData(
	IDictionary<String^, String^>^ data
)
```
```fsharp
member SetJournalData :
        data : IDictionary<string, string> -> unit
```

#### Parameters

data IDictionaryString, String

#### Reference

ExecutedEventArgs Class

Autodesk.Revit.UI.Events Namespace